{
  "country": [
    {
      "id": "USA",
      "name": "United States of America",
      "description": "A federal republic consisting of 50 states, known for its global influence in politics, economics, and culture. Major industries include technology, finance, and entertainment. It is home to world-renowned institutions like Harvard University and Silicon Valley."
    },
    {
      "id": "CHN",
      "name": "China",
      "description": "A one-party state ruled by the Communist Party, China has the world's second-largest economy. It is known for its manufacturing prowess and has significant influence in global trade. The country is also home to ancient cultural sites like the Great Wall and the Forbidden City."
    },
    {
      "id": "JPN",
      "name": "Japan",
      "description": "Japan is an island nation in East Asia known for its blend of traditional and modern culture. It is a global leader in technology, particularly in robotics and electronics. Japan is also famous for its cuisine, such as sushi and ramen, and its unique cultural practices, like tea ceremonies and sumo wrestling."
    },
    {
      "id": "AUS",
      "name": "Australia",
      "description": "Known for its diverse ecosystems, from the Great Barrier Reef to the Outback, Australia is also a major exporter of minerals and agricultural products. The country has a strong economy, with key sectors including mining, finance, and tourism."
    },
    {
      "id": "FRA",
      "name": "France",
      "description": "France is a key player in the European Union and a permanent member of the United Nations Security Council. It is known for its luxury goods, fashion industry, and as the world’s most visited country due to its landmarks like the Eiffel Tower and the Louvre Museum."
    },
    {
      "id": "NED",
      "name": "Netherlands",
      "description": "The Netherlands is a highly developed country known for its liberal policies, innovative water management, and as a major hub for international trade. The Dutch economy is driven by high-tech industries, agriculture, and services."
    },
    {
      "id": "GBR",
      "name": "United Kingdom",
      "description": "The UK has a constitutional monarchy and a parliamentary democracy. It played a significant role in world history as the center of the British Empire. The UK is a global financial center, with London being one of the leading cities for finance and culture."
    },
    {
      "id": "KOR",
      "name": "South Korea",
      "description": "South Korea is known for its rapid economic development, often referred to as the 'Miracle on the Han River.' It is a global leader in electronics, automotive, and entertainment industries, particularly known for the global popularity of K-pop and Korean dramas."
    },
    {
      "id": "ITA",
      "name": "Italy",
      "description": "Italy has a rich cultural heritage, being the birthplace of the Renaissance. It is renowned for its contributions to art, architecture, and cuisine. Italy’s economy is driven by tourism, fashion, and the automotive industry, with brands like Ferrari and Gucci."
    },
    {
      "id": "GER",
      "name": "Germany",
      "description": "Germany is the largest economy in Europe and a leader in engineering, automotive, and chemical industries. It is known for its high-quality manufacturing and as the birthplace of significant cultural and intellectual movements, including the Reformation and classical music."
    },
    {
      "id": "NZL",
      "name": "New Zealand",
      "description": "New Zealand is known for its environmental policies and as a filming location for movies like 'The Lord of the Rings.' The economy is largely based on agriculture, particularly dairy and sheep farming, as well as tourism and film production."
    },
    {
      "id": "CAN",
      "name": "Canada",
      "description": "Canada is the second-largest country by land area and is known for its natural resources, including oil, timber, and minerals. It has a diverse population and a strong healthcare and education system. The country is also known for its peacekeeping efforts and multicultural society."
    },
    {
      "id": "UZB",
      "name": "Uzbekistan",
      "description": "Uzbekistan is rich in history, being a key part of the Silk Road. The country has a strong agricultural sector, particularly in cotton production. It is also known for its historic cities like Samarkand and Bukhara, which are UNESCO World Heritage sites."
    },
    {
      "id": "HUN",
      "name": "Hungary",
      "description": "Hungary is known for its thermal spas and historical architecture, including the Buda Castle and the Parliament Building in Budapest. The country has a strong tradition in music and the arts, and its economy is driven by manufacturing and agriculture."
    },
    {
      "id": "ESP",
      "name": "Spain",
      "description": "Spain is a culturally diverse country with strong regional identities, such as Catalonia and Andalusia. It has a rich history of art, literature, and architecture, with contributions from figures like Pablo Picasso and Miguel de Cervantes. The Spanish economy is driven by tourism, agriculture, and manufacturing."
    },
    {
      "id": "SWE",
      "name": "Sweden",
      "description": "Sweden is known for its high standard of living, advanced social welfare system, and contributions to design and innovation. It has a strong economy based on exports of machinery, vehicles, and pharmaceuticals. Sweden is also known for its environmental consciousness and leadership in sustainability."
    },
    {
      "id": "KEN",
      "name": "Kenya",
      "description": "Kenya is known for its wildlife safaris, national parks, and as the cradle of humanity, with significant archaeological finds in the Great Rift Valley. The economy is based on agriculture, tourism, and services. Kenya is also known for its long-distance runners who dominate international competitions."
    },
    {
      "id": "NOR",
      "name": "Norway",
      "description": "Norway is known for its oil wealth, which has been managed through the Government Pension Fund Global, making it one of the wealthiest countries per capita. It is also famous for its fjords and outdoor lifestyle. Norway consistently ranks high in quality of life and environmental sustainability."
    }
  ]
}
